-- phpMyAdmin SQL Dump
-- version 5.1.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: May 21, 2022 at 09:08 PM
-- Server version: 10.4.22-MariaDB
-- PHP Version: 8.1.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `carrental`
--

-- --------------------------------------------------------

--
-- Table structure for table `admin`
--

CREATE TABLE `admin` (
  `id` int(11) NOT NULL,
  `UserName` varchar(100) NOT NULL,
  `Password` varchar(100) NOT NULL,
  `updationDate` timestamp NOT NULL DEFAULT '0000-00-00 00:00:00' ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `admin`
--

INSERT INTO `admin` (`id`, `UserName`, `Password`, `updationDate`) VALUES
(1, 'admin', '81dc9bdb52d04dc20036dbd8313ed055', '2022-05-09 02:06:00');

-- --------------------------------------------------------

--
-- Table structure for table `tblbooking`
--

CREATE TABLE `tblbooking` (
  `id` int(11) NOT NULL,
  `BookingNumber` bigint(12) DEFAULT NULL,
  `userEmail` varchar(100) DEFAULT NULL,
  `VehicleId` int(11) DEFAULT NULL,
  `FromDate` varchar(20) DEFAULT NULL,
  `ToDate` varchar(20) DEFAULT NULL,
  `message` varchar(255) CHARACTER SET utf8 COLLATE utf8_thai_520_w2 DEFAULT NULL,
  `Status` int(11) DEFAULT NULL,
  `PostingDate` timestamp NOT NULL DEFAULT current_timestamp(),
  `LastUpdationDate` timestamp NULL DEFAULT NULL ON UPDATE current_timestamp(),
  `Insure` varchar(100) CHARACTER SET utf8 DEFAULT NULL,
  `Payment` int(11) DEFAULT NULL,
  `Paper` varchar(120) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `tblbooking`
--

INSERT INTO `tblbooking` (`id`, `BookingNumber`, `userEmail`, `VehicleId`, `FromDate`, `ToDate`, `message`, `Status`, `PostingDate`, `LastUpdationDate`, `Insure`, `Payment`, `Paper`) VALUES
(11, 993639088, 'rapeepun@gmail.com', 6, '2022-05-10', '2022-05-15', 'รถใหม่', 1, '2022-05-09 12:09:09', '2022-05-10 19:39:02', 'ชั้น 1', 1, NULL),
(12, 646977928, 'veerayuth@gmail.com', 7, '2022-05-10', '2022-05-12', 'รถสภาพดี', 1, '2022-05-09 12:11:05', '2022-05-18 17:06:57', 'ชั้น 2+', 1, NULL),
(13, 813901431, 'veerayuth@gmail.com', 2, '2022-05-15', '2022-05-24', 'อะไรก็ได้', 1, '2022-05-10 15:55:24', '2022-05-10 19:36:34', 'ชั้น 3+', 1, NULL),
(14, 207913066, 'rapeepun@gmail.com', 2, '2022-05-25', '2022-05-28', 'aa', 1, '2022-05-18 15:35:36', '2022-05-18 15:40:43', 'ชั้น 1', 1, NULL),
(15, 268491628, 'rapeepun@gmail.com', 5, '2022-06-10', '2022-06-06', 'cc', 1, '2022-05-18 16:38:52', '2022-05-20 15:23:16', 'ชั้น 2+', 0, NULL),
(16, 419784649, 'benben@gmail.com', 17, '2022-05-31', '2022-06-10', 'dd', 1, '2022-05-18 16:42:26', '2022-05-18 16:44:02', 'ชั้น 1', 1, NULL),
(17, 551322084, 'benben@gmail.com', 13, '2022-05-18', '2022-05-19', 'pp', 1, '2022-05-18 16:42:51', '2022-05-18 16:44:46', 'ชั้น 1', 1, NULL),
(18, 344205601, 'benben@gmail.com', 20, '2022-06-15', '2022-06-18', 'cc', 1, '2022-05-18 16:43:21', '2022-05-18 16:44:27', 'ชั้น 2+', 1, NULL),
(19, 225882884, 'nong11@gmail.com', 7, '2022-06-02', '2022-06-04', 'tt', 1, '2022-05-18 16:51:44', '2022-05-18 16:55:37', 'ชั้น 3+', 1, NULL),
(20, 357902943, 'nong11@gmail.com', 3, '2022-05-19', '2022-05-22', 'll', 1, '2022-05-18 16:52:21', '2022-05-18 16:55:52', 'ชั้น 1', 1, NULL),
(21, 890984775, 'aa@gmail.com', 4, '2022-06-04', '2022-06-06', 'k', 1, '2022-05-18 16:57:33', '2022-05-18 17:01:22', 'ชั้น 3+', 1, NULL),
(22, 274763678, 'c@gmail.com', 6, '2022-05-19', '2022-05-19', 'l', 1, '2022-05-18 17:03:38', '2022-05-18 17:07:06', 'ชั้น 3+', 1, NULL),
(23, 578799378, 'c@gmail.com', 19, '2022-06-10', '2022-06-12', 'h', 1, '2022-05-18 17:04:06', '2022-05-18 17:07:17', 'ชั้น 1', 1, NULL),
(24, 158977269, 'b@gmail.com', 8, '2022-05-31', '2022-06-01', 'รถสวย', 1, '2022-05-18 17:09:33', '2022-05-18 17:13:33', 'ชั้น 1', 0, NULL),
(25, 983639410, 'veerayuth@gmail.com', 6, '2022-05-24', '2022-05-31', 'รถใหม่', 2, '2022-05-21 11:14:05', '2022-05-21 11:21:19', 'ชั้น 1', 0, NULL),
(26, 970237270, 'veerayuth@gmail.com', 3, '2022-05-24', '2022-05-26', 'รถที่สะอาด', 1, '2022-05-21 14:55:32', '2022-05-21 18:18:39', 'ชั้น 1', 1, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `tblbrands`
--

CREATE TABLE `tblbrands` (
  `id` int(11) NOT NULL,
  `BrandName` varchar(120) NOT NULL,
  `CreationDate` timestamp NULL DEFAULT current_timestamp(),
  `UpdationDate` timestamp NULL DEFAULT NULL ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `tblbrands`
--

INSERT INTO `tblbrands` (`id`, `BrandName`, `CreationDate`, `UpdationDate`) VALUES
(1, 'Maruti', '2017-06-18 16:24:34', '2017-06-19 06:42:23'),
(2, 'BMW', '2017-06-18 16:24:50', NULL),
(3, 'Audi', '2017-06-18 16:25:03', NULL),
(4, 'Nissan', '2017-06-18 16:25:13', NULL),
(5, 'Toyota', '2017-06-18 16:25:24', NULL),
(7, 'Volkswagon', '2017-06-19 06:22:13', '2020-07-07 14:14:09'),
(8, 'Honda', '2022-05-09 10:08:40', NULL),
(9, 'Mitsubishi', '2022-05-09 10:09:07', NULL),
(10, 'Suzuki', '2022-05-09 10:09:29', NULL),
(11, 'Hyundai', '2022-05-09 10:09:50', NULL),
(12, 'Mazda', '2022-05-09 10:09:59', NULL),
(13, 'Ford', '2022-05-09 10:10:27', NULL),
(14, 'Subaru', '2022-05-09 10:10:45', NULL),
(15, 'Lexus', '2022-05-09 10:11:42', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `tblcontactusinfo`
--

CREATE TABLE `tblcontactusinfo` (
  `id` int(11) NOT NULL,
  `Address` tinytext CHARACTER SET utf8 COLLATE utf8_thai_520_w2 DEFAULT NULL,
  `EmailId` varchar(255) DEFAULT NULL,
  `ContactNo` char(11) CHARACTER SET utf8 DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `tblcontactusinfo`
--

INSERT INTO `tblcontactusinfo` (`id`, `Address`, `EmailId`, `ContactNo`) VALUES
(1, '1041 29 ถนน เพลินจิต แขวง ลุมพินี เขตปทุมวัน กรุงเทพมหานคร 10330', 'utcc_carrental@gmail.com', '012-3456789');

-- --------------------------------------------------------

--
-- Table structure for table `tblcontactusquery`
--

CREATE TABLE `tblcontactusquery` (
  `id` int(11) NOT NULL,
  `name` varchar(100) CHARACTER SET utf8 COLLATE utf8_thai_520_w2 DEFAULT NULL,
  `EmailId` varchar(120) DEFAULT NULL,
  `ContactNumber` char(11) DEFAULT NULL,
  `Message` longtext CHARACTER SET utf8 DEFAULT NULL,
  `PostingDate` timestamp NOT NULL DEFAULT current_timestamp(),
  `status` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `tblcontactusquery`
--

INSERT INTO `tblcontactusquery` (`id`, `name`, `EmailId`, `ContactNumber`, `Message`, `PostingDate`, `status`) VALUES
(1, 'Kunal ', 'kunal@gmail.com', '7977779798', 'I want to know you brach in Chandigarh?', '2020-07-07 09:34:51', 1),
(5, 'วีรยุทธ บุษรารังษี', 'veerayuth@gmail.com', '0995675334', 'มีโปรโมชั่นในช่วงหน้าหนาวมั้ย', '2022-05-09 12:12:48', 1),
(6, 'ben ben', 'benben@gmail.com', '0991234567', 'มีส่วนลดไหมคะ', '2022-05-18 16:47:24', 1),
(7, 'nong', 'nong11@gmail.com', '0987654321', 'โปรโมชั่น6.6 มีไหม', '2022-05-18 16:54:18', 1),
(8, 'nong', 'nong11@gmail.com', '0987654321', 'โปรโมชั่น6.6 มีไหม', '2022-05-18 16:55:57', 1),
(9, 'nong', 'nong11@gmail.com', '0987654321', 'โปรโมชั่น6.6 มีไหม', '2022-05-18 16:56:00', 1),
(10, 'aa', 'aa@gmail.com', '0888888', 'จองได้มากสุดกี่วัน', '2022-05-18 17:00:25', 1),
(11, 'mai', 'mai.candy.2002@gmail.com', '12345678', 'จ่ายผ่านอะไรได้บ้าง', '2022-05-18 17:02:13', 1),
(12, 'c', 'c@gmail.com', '12345', 'เกิดอุบัติเหตุทำยังไง', '2022-05-18 17:05:57', 1),
(13, 'ิb', 'b@gmail.com', '666666', 'จัดส่งรถยังไง', '2022-05-18 17:10:54', 1),
(14, 'นนน', 'n@gmail.com', '111111', 'ใช้อะไรค้ำ', '2022-05-18 17:11:38', NULL),
(15, 'ดำ ดำ', 'd@gmail.com', '444444', 'วิธีการใช้จอง', '2022-05-18 17:12:49', NULL),
(16, 'nicha', 'nicha@gmail.com', '111111111', 'แนะนำรถหน่อย', '2022-05-18 17:17:34', NULL);

-- --------------------------------------------------------

--
-- Table structure for table `tblpages`
--

CREATE TABLE `tblpages` (
  `id` int(11) NOT NULL,
  `PageName` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `type` varchar(255) CHARACTER SET utf8 NOT NULL DEFAULT '',
  `detail` longtext CHARACTER SET utf8 NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=latin1;

--
-- Dumping data for table `tblpages`
--

INSERT INTO `tblpages` (`id`, `PageName`, `type`, `detail`) VALUES
(1, 'ข้อกำหนดและเงื่อนไข', 'terms', '										<p align=\"justify\"><span style=\"color: rgb(153, 0, 0); font-size: small; font-weight: 700;\">(1) การยอมรับข้อกำหนด</span></p><p align=\"justify\"><span style=\"color: rgb(153, 0, 0); font-size: small; font-weight: 700;\"><br></span></p><p align=\"justify\"><span style=\"color: rgb(153, 0, 0); font-size: small; font-weight: 700;\">ยินดีต้อนรับสู่ Yahoo! อินเดีย. 1Yahoo Web Services India Private Limited Yahoo\", \"เรา\" หรือ \"พวกเรา\" แล้วแต่กรณี) ให้บริการ (ตามคำจำกัดความด้านล่าง) แก่คุณ โดยอยู่ภายใต้ข้อกำหนดในการให้บริการ (\"TOS\") ต่อไปนี้ ซึ่งอาจปรับปรุงโดย เราเป็นครั้งคราวโดยไม่ต้องแจ้งให้คุณทราบ คุณสามารถตรวจสอบ TOS เวอร์ชันล่าสุดได้ตลอดเวลาที่: http://in.docs.yahoo.com/info/terms/ นอกจากนี้ เมื่อใช้บริการของ Yahoo โดยเฉพาะ หรือบริการของบุคคลภายนอก คุณและ Yahoo จะต้องปฏิบัติตามแนวทางหรือกฎเกณฑ์ใดๆ ที่โพสต์ไว้ซึ่งมีผลบังคับใช้กับบริการดังกล่าวซึ่งอาจมีการโพสต์เป็นครั้งคราว ทั้งนี้ แนวทางหรือกฎเกณฑ์ดังกล่าวทั้งหมดซึ่งอาจมีการเปลี่ยนแปลงได้รวมไว้ในที่นี้โดยการอ้างอิงใน TOS ในกรณีส่วนใหญ่ คำแนะนำและกฎเกณฑ์จะเฉพาะเจาะจงสำหรับส่วนใดส่วนหนึ่งของบริการและจะช่วยคุณในการใช้ TOS กับส่วนนั้น แต่ในขอบเขตของความไม่สอดคล้องกันระหว่าง TOS กับแนวทางหรือกฎใดๆ TOS จะมีผลเหนือกว่า เราอาจเสนอบริการอื่นๆ เป็นครั้งคราวซึ่งอยู่ภายใต้ข้อกำหนดที่แตกต่างกันของ บริการ ซึ่งในกรณีนี้ TOS จะไม่มีผลบังคับใช้กับบริการอื่นๆ ดังกล่าว หากและในขอบเขตได้รับการยกเว้นโดยชัดแจ้งโดยข้อกำหนดในการให้บริการที่แตกต่างกันดังกล่าว Yahoo อาจเสนอบริการอื่นๆ เป็นครั้งคราวซึ่งอยู่ภายใต้ข้อกำหนดในการให้บริการที่แตกต่างกัน TOS เหล่านี้ใช้ไม่ได้กับบริการอื่น ๆ ที่อยู่ภายใต้ข้อกำหนดในการให้บริการที่แตกต่างกัน</span></p><p align=\"justify\"><span style=\"color: rgb(153, 0, 0); font-size: small; font-weight: 700;\"><br></span></p><p align=\"justify\"><span style=\"color: rgb(153, 0, 0); font-size: small; font-weight: 700;\">ยินดีต้อนรับสู่ Yahoo! อินเดีย. Yahoo Web Services India Private Limited Yahoo\", \"เรา\" หรือ \"พวกเรา\" แล้วแต่กรณี) ให้บริการ (ตามคำจำกัดความด้านล่าง) แก่คุณ โดยอยู่ภายใต้ข้อกำหนดในการให้บริการ (\"TOS\") ต่อไปนี้ ซึ่งอาจปรับปรุงโดย เราเป็นครั้งคราวโดยไม่ต้องแจ้งให้คุณทราบ คุณสามารถตรวจสอบ TOS เวอร์ชันล่าสุดได้ตลอดเวลาที่: http://in.docs.yahoo.com/info/terms/ นอกจากนี้ เมื่อใช้บริการของ Yahoo โดยเฉพาะ หรือบริการของบุคคลภายนอก คุณและ Yahoo จะต้องปฏิบัติตามแนวทางหรือกฎเกณฑ์ใดๆ ที่โพสต์ไว้ซึ่งมีผลบังคับใช้กับบริการดังกล่าวซึ่งอาจมีการโพสต์เป็นครั้งคราว ทั้งนี้ แนวทางหรือกฎเกณฑ์ดังกล่าวทั้งหมดซึ่งอาจมีการเปลี่ยนแปลงได้รวมไว้ในที่นี้โดยการอ้างอิงใน TOS ในกรณีส่วนใหญ่ คำแนะนำและกฎเกณฑ์จะเฉพาะเจาะจงสำหรับส่วนใดส่วนหนึ่งของบริการและจะช่วยคุณในการใช้ TOS กับส่วนนั้น แต่ในขอบเขตของความไม่สอดคล้องกันระหว่าง TOS กับแนวทางหรือกฎใดๆ TOS จะมีผลเหนือกว่า เราอาจเสนอบริการอื่นๆ เป็นครั้งคราวซึ่งอยู่ภายใต้ข้อกำหนดที่แตกต่างกันของ S บริการ ซึ่งในกรณีนี้ TOS จะไม่มีผลบังคับใช้กับบริการอื่นๆ ดังกล่าว หากและในขอบเขตได้รับการยกเว้นโดยชัดแจ้งโดยข้อกำหนดในการให้บริการที่แตกต่างกันดังกล่าว Yahoo อาจเสนอบริการอื่นๆ เป็นครั้งคราวซึ่งอยู่ภายใต้ข้อกำหนดในการให้บริการที่แตกต่างกัน TOS เหล่านี้ใช้ไม่ได้กับบริการอื่น ๆ ที่อยู่ภายใต้ข้อกำหนดในการให้บริการที่แตกต่างกัน</span></p><p align=\"justify\"><span style=\"color: rgb(153, 0, 0); font-size: small; font-weight: 700;\"><br></span></p><p align=\"justify\"><span style=\"color: rgb(153, 0, 0); font-size: small; font-weight: 700;\">ยินดีต้อนรับสู่ Yahoo! อินเดีย. Yahoo Web Services India Private Limited Yahoo\", \"เรา\" หรือ \"พวกเรา\" แล้วแต่กรณี) ให้บริการ (ตามคำจำกัดความด้านล่าง) แก่คุณ โดยอยู่ภายใต้ข้อกำหนดในการให้บริการ (\"TOS\") ต่อไปนี้ ซึ่งอาจปรับปรุงโดย เราเป็นครั้งคราวโดยไม่ต้องแจ้งให้คุณทราบ คุณสามารถตรวจสอบ TOS เวอร์ชันล่าสุดได้ตลอดเวลาที่: http://in.docs.yahoo.com/info/terms/ นอกจากนี้ เมื่อใช้บริการของ Yahoo โดยเฉพาะ หรือบริการของบุคคลภายนอก คุณและ Yahoo จะต้องปฏิบัติตามแนวทางหรือกฎเกณฑ์ใดๆ ที่โพสต์ไว้ซึ่งมีผลบังคับใช้กับบริการดังกล่าวซึ่งอาจมีการโพสต์เป็นครั้งคราว ทั้งนี้ แนวทางหรือกฎเกณฑ์ดังกล่าวทั้งหมดซึ่งอาจมีการเปลี่ยนแปลงได้รวมไว้ในที่นี้โดยการอ้างอิงใน TOS ในกรณีส่วนใหญ่ คำแนะนำและกฎเกณฑ์จะเฉพาะเจาะจงสำหรับส่วนใดส่วนหนึ่งของบริการและจะช่วยคุณในการใช้ TOS กับส่วนนั้น แต่ในขอบเขตของความไม่สอดคล้องกันระหว่าง TOS กับแนวทางหรือกฎใดๆ TOS จะมีผลเหนือกว่า เราอาจเสนอบริการอื่นๆ เป็นครั้งคราวซึ่งอยู่ภายใต้ข้อกำหนดที่แตกต่างกันของ S บริการ ซึ่งในกรณีนี้ TOS จะไม่มีผลบังคับใช้กับบริการอื่นๆ ดังกล่าว หากและในขอบเขตได้รับการยกเว้นโดยชัดแจ้งโดยข้อกำหนดในการให้บริการที่แตกต่างกันดังกล่าว Yahoo อาจเสนอบริการอื่นๆ เป็นครั้งคราวซึ่งอยู่ภายใต้ข้อกำหนดในการให้บริการที่แตกต่างกัน TOS เหล่านี้ใช้ไม่ได้กับบริการอื่น ๆ ที่อยู่ภายใต้ข้อกำหนดในการให้บริการที่แตกต่างกัน</span></p>\r\n										'),
(2, 'นโยบายความเป็นส่วนตัว', 'privacy', '<div style=\"text-align: justify;\"><span style=\"color: rgb(0, 0, 0); font-family: &quot;Open Sans&quot;, Arial, sans-serif;\">นโยบายความเป็นส่วนตัวนี้อธิบายนโยบายและขั้นตอนของเราในการรวบรวม การใช้ และการเปิดเผยข้อมูลของคุณเมื่อคุณใช้บริการและบอกคุณเกี่ยวกับสิทธิ์ความเป็นส่วนตัวของคุณและวิธีที่กฎหมายปกป้องคุณ เราใช้ข้อมูลส่วนบุคคลของคุณเพื่อให้บริการและปรับปรุงบริการ โดยการใช้บริการ คุณตกลงที่จะรวบรวมและใช้ข้อมูลตามนโยบายความเป็นส่วนตัวนี้ นโยบายความเป็นส่วนตัวนี้ถูกสร้างขึ้นด้วยความช่วยเหลือของแม่แบบนโยบายความเป็นส่วนตัว การตีความและคำจำกัดความ การตีความ คำที่ใช้อักษรตัวพิมพ์ใหญ่มีความหมายตามเงื่อนไขดังต่อไปนี้ คำจำกัดความต่อไปนี้จะมีความหมายเหมือนกันไม่ว่าจะปรากฏในเอกพจน์หรือพหูพจน์ คำจำกัดความ เพื่อวัตถุประสงค์ของนโยบายความเป็นส่วนตัวนี้: บัญชี หมายถึงบัญชีเฉพาะที่สร้างขึ้นสำหรับคุณเพื่อเข้าถึงบริการของเราหรือบางส่วนของบริการของเรา บริษัท (เรียกว่า \"บริษัท\", \"เรา\", \"เรา\" หรือ \"ของเรา\" ในข้อตกลงนี้) หมายถึงพอร์ทัลรถเช่า คุกกี้คือไฟล์ขนาดเล็กที่วางบนคอมพิวเตอร์ อุปกรณ์มือถือ หรืออุปกรณ์อื่นใดโดยเว็บไซต์ ซึ่งประกอบด้วยรายละเอียดประวัติการท่องเว็บของคุณบนเว็บไซต์นั้น ท่ามกลางการใช้งานมากมาย ประเทศ หมายถึง: Thailand อุปกรณ์ หมายถึงอุปกรณ์ใดๆ ที่สามารถเข้าถึงบริการได้ เช่น คอมพิวเตอร์ โทรศัพท์มือถือ หรือแท็บเล็ตดิจิทัล ข้อมูลส่วนบุคคลคือข้อมูลใด ๆ ที่เกี่ยวข้องกับบุคคลที่ระบุตัวตนหรือระบุตัวตนได้ บริการหมายถึงเว็บไซต์ ผู้ให้บริการ หมายถึง บุคคลธรรมดาหรือนิติบุคคลใดๆ ที่ประมวลผลข้อมูลในนามของบริษัท หมายถึงบริษัทหรือบุคคลภายนอกที่ว่าจ้างโดยบริษัทเพื่ออำนวยความสะดวกในการให้บริการ เพื่อให้บริการในนามของบริษัท เพื่อดำเนินการบริการที่เกี่ยวข้องกับบริการ หรือเพื่อช่วยบริษัทในการวิเคราะห์วิธีการใช้บริการ ข้อมูลการใช้งานหมายถึงข้อมูลที่รวบรวมโดยอัตโนมัติ ไม่ว่าจะสร้างขึ้นจากการใช้บริการหรือจากโครงสร้างพื้นฐานของบริการเอง (เช่น ระยะเวลาของการเยี่ยมชมหน้า) เว็บไซต์หมายถึง Car Rental Portal เข้าถึงได้จาก https://www.carrentalportal.com คุณหมายถึงบุคคลที่เข้าถึงหรือใช้บริการ หรือบริษัท หรือนิติบุคคลอื่น ๆ ในนามของบุคคลดังกล่าวกำลังเข้าถึงหรือใช้บริการ ตามความเหมาะสม การรวบรวมและการใช้ข้อมูลส่วนบุคคลของคุณ ประเภทของข้อมูลที่เก็บรวบรวม ข้อมูลส่วนบุคคล ขณะใช้บริการของเรา เราอาจขอให้คุณให้ข้อมูลที่สามารถระบุตัวบุคคลได้ ซึ่งสามารถใช้เพื่อติดต่อหรือระบุตัวคุณได้ ข้อมูลส่วนบุคคลที่สามารถระบุตัวตนได้อาจรวมถึงแต่ไม่จำกัดเพียง: ที่อยู่อีเมล ชื่อและนามสกุล หมายเลขโทรศัพท์ ที่อยู่ รัฐ จังหวัด รหัสไปรษณีย์ เมือง ข้อมูลการใช้งาน ข้อมูลการใช้งาน ข้อมูลการใช้งานจะถูกเก็บรวบรวมโดยอัตโนมัติเมื่อใช้บริการ ข้อมูลการใช้งานอาจรวมถึงข้อมูล เช่น ที่อยู่ Internet Protocol ของอุปกรณ์ของคุณ (เช่น ที่อยู่ IP) ประเภทเบราว์เซอร์ เวอร์ชันของเบราว์เซอร์ หน้าบริการของเราที่คุณเยี่ยมชม เวลาและวันที่ที่คุณเยี่ยมชม เวลาที่ใช้ในหน้าเหล่านั้น อุปกรณ์เฉพาะ ตัวระบุและข้อมูลการวินิจฉัยอื่น ๆ เมื่อคุณเข้าถึงบริการโดยหรือผ่านอุปกรณ์มือถือ เราอาจรวบรวมข้อมูลบางอย่างโดยอัตโนมัติ ซึ่งรวมถึงแต่ไม่จำกัดเฉพาะประเภทของอุปกรณ์มือถือที่คุณใช้ ID เฉพาะของอุปกรณ์มือถือของคุณ ที่อยู่ IP ของอุปกรณ์มือถือของคุณ มือถือของคุณ ระบบปฏิบัติการ ประเภทของอินเทอร์เน็ตเบราว์เซอร์บนมือถือที่คุณใช้ ตัวระบุอุปกรณ์เฉพาะ และข้อมูลการวินิจฉัยอื่นๆ เราอาจรวบรวมข้อมูลที่เบราว์เซอร์ของคุณส่งเมื่อใดก็ตามที่คุณเยี่ยมชมบริการของเราหรือเมื่อคุณเข้าถึงบริการโดยหรือผ่านอุปกรณ์มือถือ เทคโนโลยีการติดตามและคุกกี้ เราใช้คุกกี้และเทคโนโลยีการติดตามที่คล้ายกันเพื่อติดตามกิจกรรมในบริการของเราและจัดเก็บข้อมูลบางอย่าง เทคโนโลยีการติดตามที่ใช้คือบีคอน แท็ก และสคริปต์เพื่อรวบรวมและติดตามข้อมูล และปรับปรุงและวิเคราะห์บริการของเรา เทคโนโลยีที่เราใช้อาจรวมถึง: คุกกี้หรือคุกกี้เบราว์เซอร์ คุกกี้คือไฟล์ขนาดเล็กที่วางอยู่บนอุปกรณ์ของคุณ คุณสามารถสั่งให้เบราว์เซอร์ของคุณปฏิเสธคุกกี้ทั้งหมดหรือระบุว่าเมื่อใดที่มีการส่งคุกกี้ อย่างไรก็ตาม หากคุณไม่ยอมรับคุกกี้ คุณอาจไม่สามารถใช้บริการบางส่วนของเราได้ เว้นแต่คุณจะปรับการตั้งค่าเบราว์เซอร์ของคุณเพื่อที่จะปฏิเสธคุกกี้ บริการของเราอาจใช้คุกกี้ แฟลชคุกกี้. คุณลักษณะบางอย่างของบริการของเราอาจใช้วัตถุที่จัดเก็บไว้ในเครื่อง (หรือแฟลชคุกกี้) เพื่อรวบรวมและจัดเก็บข้อมูลเกี่ยวกับการตั้งค่าของคุณหรือกิจกรรมของคุณบนบริการของเรา Flash Cookies ไม่ได้รับการจัดการโดยการตั้งค่าเบราว์เซอร์เดียวกันกับที่ใช้สำหรับ Browser Cookies สำหรับข้อมูลเพิ่มเติมเกี่ยวกับวิธีการลบแฟลชคุกกี้ โปรดอ่าน \"ฉันจะเปลี่ยนการตั้งค่าสำหรับการปิดใช้งานหรือลบวัตถุที่ใช้ร่วมกันในเครื่องได้ที่ไหน\" ได้ที่ https://helpx.adobe.com/flash-player/kb/disable-local-shared-objects-flash.html#main_Where_can_I_change_the_settings_for_disabling__or_deleting_local_shared_objects_ เว็บบีคอน บางส่วนของบริการและอีเมลของเราอาจมีไฟล์อิเล็กทรอนิกส์ขนาดเล็กที่เรียกว่าเว็บบีคอน (เรียกอีกอย่างว่า clear gif, pixel tags และ gif พิกเซลเดียว) ที่อนุญาตให้บริษัทนับจำนวนผู้ใช้ที่เข้าชมหน้าเหล่านั้น หรือเปิดอีเมลและสำหรับสถิติเว็บไซต์อื่น ๆ ที่เกี่ยวข้อง (เช่น การบันทึกความนิยมของบางส่วนและการตรวจสอบความถูกต้องของระบบและความสมบูรณ์ของเซิร์ฟเวอร์) คุกกี้อาจเป็นคุกกี้ \"ถาวร\" หรือ \"เซสชัน\" คุกกี้ถาวรยังคงอยู่บนคอมพิวเตอร์ส่วนบุคคลหรืออุปกรณ์มือถือของคุณเมื่อคุณออฟไลน์ ในขณะที่คุกกี้ของเซสชันจะถูกลบทันทีที่คุณปิดเว็บเบราว์เซอร์ของคุณ เรียนรู้เพิ่มเติมเกี่ยวกับคุกกี้: คุกกี้โดย PrivacyPolicies Generator เราใช้ทั้งเซสชันและคุกกี้ถาวรเพื่อวัตถุประสงค์ที่กำหนดไว้ด้านล่าง: คุกกี้ที่จำเป็น/จำเป็น ประเภท: คุกกี้เซสชัน ดูแลโดย: Us วัตถุประสงค์: คุกกี้เหล่านี้มีความจำเป็นต่อการให้บริการแก่คุณผ่านทางเว็บไซต์ และเพื่อให้คุณสามารถใช้คุณลักษณะบางอย่างของเว็บไซต์ได้ ช่วยตรวจสอบสิทธิ์ผู้ใช้และป้องกันการใช้บัญชีผู้ใช้ที่เป็นการฉ้อโกง หากไม่มีคุกกี้เหล่านี้ บริการที่คุณขอจะไม่สามารถให้บริการได้ และเราใช้คุกกี้เหล่านี้เพื่อให้บริการเหล่านั้นแก่คุณเท่านั้น นโยบายคุกกี้ / คุกกี้การยอมรับคำบอกกล่าว ประเภท: คุกกี้ถาวร ดูแลโดย: Us วัตถุประสงค์: คุกกี้เหล่านี้ระบุว่าผู้ใช้ยอมรับการใช้คุกกี้บนเว็บไซต์หรือไม่ คุกกี้ฟังก์ชัน ประเภท: คุกกี้ถาวร ดูแลโดย: Us วัตถุประสงค์: คุกกี้เหล่านี้ช่วยให้เราจดจำตัวเลือกที่คุณทำเมื่อคุณใช้เว็บไซต์ เช่น การจดจำรายละเอียดการเข้าสู่ระบบหรือการตั้งค่าภาษาของคุณ จุดประสงค์ของคุกกี้เหล่านี้คือเพื่อให้คุณได้รับประสบการณ์ที่เป็นส่วนตัวมากขึ้น และเพื่อหลีกเลี่ยงไม่ให้คุณต้องป้อนการตั้งค่าของคุณใหม่ทุกครั้งที่คุณใช้เว็บไซต์ สำหรับข้อมูลเพิ่มเติมเกี่ยวกับคุกกี้ที่เราใช้และตัวเลือกของคุณเกี่ยวกับคุกกี้ โปรดไปที่นโยบายคุกกี้ของเราหรือส่วนคุกกี้ของนโยบายความเป็นส่วนตัวของเรา การใช้ข้อมูลส่วนบุคคลของคุณ บริษัทอาจใช้ข้อมูลส่วนบุคคลเพื่อวัตถุประสงค์ดังต่อไปนี้: เพื่อจัดหาและบำรุงรักษาบริการของเรา รวมถึงเพื่อตรวจสอบการใช้บริการของเรา ในการจัดการบัญชีของคุณ: เพื่อจัดการการลงทะเบียนของคุณในฐานะผู้ใช้บริการ ข้อมูลส่วนบุคคลที่คุณให้สามารถให้คุณเข้าถึงฟังก์ชันต่างๆ ของบริการที่คุณมีได้ในฐานะผู้ใช้ที่ลงทะเบียน สำหรับการปฏิบัติตามสัญญา: การพัฒนา การปฏิบัติตามและการดำเนินการของสัญญาซื้อผลิตภัณฑ์ รายการหรือบริการที่คุณซื้อหรือของสัญญาอื่นใดกับเราผ่านทางบริการ วิธีติดต่อคุณ: เพื่อติดต่อคุณทางอีเมล โทรศัพท์ SMS หรือรูปแบบการสื่อสารทางอิเล็กทรอนิกส์อื่น ๆ ที่เทียบเท่า เช่น การแจ้งเตือนแบบพุชของแอปพลิเคชันมือถือเกี่ยวกับการอัปเดตหรือการสื่อสารข้อมูลที่เกี่ยวข้องกับฟังก์ชันการทำงาน ผลิตภัณฑ์ หรือบริการตามสัญญา รวมถึงการอัปเดตด้านความปลอดภัย เมื่อจำเป็นหรือสมเหตุสมผลในการดำเนินการ เพื่อให้ข่าวสาร ข้อเสนอพิเศษ และข้อมูลทั่วไปเกี่ยวกับสินค้า บริการ และกิจกรรมอื่นๆ ที่เรานำเสนอซึ่งคล้ายกับที่คุณได้ซื้อหรือสอบถามไปแล้ว เว้นแต่คุณได้เลือกที่จะไม่รับข้อมูลดังกล่าว เพื่อจัดการคำขอของคุณ: เพื่อเข้าร่วมและจัดการคำขอของคุณถึงเรา สำหรับการโอนธุรกิจ: เราอาจใช้ข้อมูลของคุณเพื่อประเมินหรือดำเนินการควบรวมกิจการ การขายกิจการ การปรับโครงสร้าง การปรับโครงสร้างองค์กร การเลิกกิจการ หรือการขายหรือการโอนทรัพย์สินบางส่วนหรือทั้งหมดของเรา ไม่ว่าจะเป็นการดำเนินการต่อเนื่องหรือเป็นส่วนหนึ่งของการล้มละลาย การชำระบัญชี หรือการดำเนินการที่คล้ายคลึงกัน ซึ่งข้อมูลส่วนบุคคลที่ถือโดยเราเกี่ยวกับผู้ใช้บริการของเราเป็นหนึ่งในทรัพย์สินที่ถ่ายโอน เพื่อวัตถุประสงค์อื่น: เราอาจใช้ข้อมูลของคุณเพื่อวัตถุประสงค์อื่น เช่น การวิเคราะห์ข้อมูล การระบุแนวโน้มการใช้งาน การกำหนดประสิทธิภาพของแคมเปญส่งเสริมการขายของเรา และเพื่อประเมินและปรับปรุงบริการ ผลิตภัณฑ์ บริการ การตลาด และประสบการณ์ของคุณ เราอาจแบ่งปันข้อมูลส่วนบุคคลของคุณในสถานการณ์ต่อไปนี้: กับผู้ให้บริการ: เราอาจแบ่งปันข้อมูลส่วนบุคคลของคุณกับผู้ให้บริการเพื่อตรวจสอบและวิเคราะห์การใช้บริการของเรา เพื่อติดต่อคุณ สำหรับการถ่ายโอนธุรกิจ: เราอาจแบ่งปันหรือถ่ายโอนข้อมูลส่วนบุคคลของคุณที่เกี่ยวข้องกับหรือในระหว่างการเจรจาการควบรวมกิจการ การขายทรัพย์สินของบริษัท การจัดหาเงินทุน หรือการซื้อธุรกิจทั้งหมดหรือบางส่วนของเราไปยังบริษัทอื่น กับบริษัทในเครือ: เราอาจแบ่งปันข้อมูลของคุณกับบริษัทในเครือของเรา ซึ่งในกรณีนี้ เราจะกำหนดให้บริษัทในเครือเหล่านั้นปฏิบัติตามนโยบายความเป็นส่วนตัวนี้ บริษัทในเครือรวมถึงบริษัทแม่ของเราและบริษัทในเครืออื่นๆ พันธมิตรร่วมทุนหรือบริษัทอื่นๆ ที่เราควบคุมหรืออยู่ภายใต้การควบคุมเดียวกันกับเรา กับพันธมิตรทางธุรกิจ: เราอาจแบ่งปันข้อมูลของคุณกับพันธมิตรทางธุรกิจของเราเพื่อนำเสนอผลิตภัณฑ์ บริการ หรือโปรโมชั่นบางอย่างแก่คุณ กับผู้ใช้รายอื่น: เมื่อคุณแบ่งปันข้อมูลส่วนบุคคลหรือโต้ตอบกับผู้ใช้รายอื่นในพื้นที่สาธารณะ ผู้ใช้ทุกคนอาจดูข้อมูลดังกล่าวและอาจเผยแพร่สู่สาธารณะภายนอก ด้วยความยินยอมของคุณ: เราอาจเปิดเผยข้อมูลส่วนบุคคลของคุณเพื่อวัตถุประสงค์อื่นใดโดยได้รับความยินยอมจากคุณ การเก็บรักษาข้อมูลส่วนบุคคลของคุณ บริษัทจะเก็บข้อมูลส่วนบุคคลของคุณไว้ตราบเท่าที่จำเป็นสำหรับวัตถุประสงค์ที่กำหนดไว้ในนโยบายความเป็นส่วนตัวนี้ เราจะเก็บรักษาและใช้ข้อมูลส่วนบุคคลของคุณเท่าที่จำเป็นเพื่อปฏิบัติตามภาระผูกพันทางกฎหมายของเรา (เช่น หากเราจำเป็นต้องเก็บรักษาข้อมูลของคุณเพื่อให้เป็นไปตามกฎหมายที่บังคับใช้) แก้ไขข้อพิพาท และบังคับใช้ข้อตกลงและนโยบายทางกฎหมายของเรา บริษัทจะยังเก็บข้อมูลการใช้งานเพื่อวัตถุประสงค์ในการวิเคราะห์ภายใน โดยทั่วไป ข้อมูลการใช้งานจะถูกเก็บรักษาไว้เป็นระยะเวลาที่สั้นลง ยกเว้นในกรณีที่มีการใช้ข้อมูลนี้เพื่อเพิ่มความปลอดภัยหรือปรับปรุงฟังก์ชันการทำงานของบริการของเรา หรือเรามีหน้าที่ตามกฎหมายที่จะต้องเก็บข้อมูลนี้ไว้เป็นระยะเวลานาน การถ่ายโอนข้อมูลส่วนบุคคลของคุณ ข้อมูลของคุณ รวมถึงข้อมูลส่วนบุคคล จะได้รับการประมวลผลที่สำนักงานปฏิบัติการของบริษัทและในสถานที่อื่น ๆ ที่ฝ่ายที่เกี่ยวข้องในการประมวลผลตั้งอยู่ หมายความว่าข้อมูลนี้อาจถูกถ่ายโอนไปยัง — และรักษาไว้ — คอมพิวเตอร์ที่อยู่นอกรัฐ จังหวัด ประเทศ หรือเขตอำนาจศาลอื่นๆ ของรัฐบาล ซึ่งกฎหมายคุ้มครองข้อมูลอาจแตกต่างไปจากเขตอำนาจศาลของคุณ ความยินยอมของคุณต่อนโยบายความเป็นส่วนตัวนี้ตามด้วยการส่งข้อมูลดังกล่าวของคุณแสดงถึงข้อตกลงของคุณในการถ่ายโอนนั้น บริษัทจะดำเนินการทุกขั้นตอนตามสมควรเพื่อให้แน่ใจว่าข้อมูลของคุณได้รับการปฏิบัติอย่างปลอดภัยและเป็นไปตามนโยบายความเป็นส่วนตัวนี้ และจะไม่มีการถ่ายโอนข้อมูลส่วนบุคคลของคุณไปยังองค์กรหรือประเทศ เว้นแต่จะมีการควบคุมที่เพียงพอรวมถึงการรักษาความปลอดภัยของ ข้อมูลของคุณและข้อมูลส่วนบุคคลอื่นๆ การเปิดเผยข้อมูลส่วนบุคคลของคุณ ธุรกรรมทางธุรกิจ หากบริษัทเกี่ยวข้องกับการควบรวมกิจการ การได้มา หรือการขายทรัพย์สิน ข้อมูลส่วนบุคคลของคุณอาจถูกถ่ายโอน เราจะแจ้งให้ทราบก่อนที่ข้อมูลส่วนบุคคลของคุณจะถูกถ่ายโอนและอยู่ภายใต้นโยบายความเป็นส่วนตัวที่แตกต่างกัน การบังคับใช้กฎหมาย ในบางกรณี บริษัทอาจจำเป็นต้องเปิดเผยข้อมูลส่วนบุคคลของคุณ หากจำเป็นต้องทำตามกฎหมายหรือเพื่อตอบสนองต่อคำขอที่ถูกต้องจากหน่วยงานของรัฐ (เช่น ศาลหรือหน่วยงานของรัฐ) ข้อกำหนดทางกฎหมายอื่น ๆ บริษัทอาจเปิดเผยข้อมูลส่วนบุคคลของคุณด้วยความเชื่อโดยสุจริตว่าการกระทำดังกล่าวมีความจำเป็นเพื่อ: ปฏิบัติตามข้อผูกพันทางกฎหมาย ปกป้องและปกป้องสิทธิหรือทรัพย์สินของบริษัท ป้องกันหรือตรวจสอบการกระทำผิดที่อาจเกิดขึ้นกับบริการ ปกป้องความปลอดภัยส่วนบุคคลของผู้ใช้บริการหรือสาธารณะ ป้องกันความรับผิดทางกฎหมาย ความปลอดภัยของข้อมูลส่วนบุคคลของคุณ การรักษาความปลอดภัยของข้อมูลส่วนบุคคลของคุณมีความสำคัญต่อเรา แต่อย่าลืมว่าไม่มีวิธีการใดในการส่งผ่านอินเทอร์เน็ต หรือวิธีการจัดเก็บข้อมูลอิเล็กทรอนิกส์ที่ปลอดภัย 100% ในขณะที่เราพยายามใช้วิธีการที่ยอมรับได้ในเชิงพาณิชย์เพื่อปกป้องข้อมูลส่วนบุคคลของคุณ เราไม่สามารถรับประกันความปลอดภัยได้อย่างสมบูรณ์ ข้อมูลรายละเอียดเกี่ยวกับการประมวลผลข้อมูลส่วนบุคคลของคุณ ผู้ให้บริการที่เราใช้อาจเข้าถึงข้อมูลส่วนบุคคลของคุณได้ ผู้จำหน่ายบุคคลที่สามเหล่านี้รวบรวม จัดเก็บ ใช้ ประมวลผล และโอนข้อมูลเกี่ยวกับกิจกรรมของคุณบนบริการของเราตามนโยบายความเป็นส่วนตัวของพวกเขา การใช้งาน ประสิทธิภาพ และเบ็ดเตล็ด เราอาจใช้ผู้ให้บริการบุคคลที่สามเพื่อปรับปรุงบริการของเราให้ดีขึ้น Mouseflow Mouseflow คือเซสชันการเล่นซ้ำและเครื่องมือแผนที่ความหนาแน่นที่แสดงวิธีที่ผู้เยี่ยมชมคลิก ย้าย เลื่อน เรียกดู และให้ความสนใจบนเว็บไซต์ บริการนี้ดำเนินการโดย ApS บริการ Mouseflow อาจรวบรวมข้อมูลจากอุปกรณ์ของคุณ ข้อมูลที่รวบรวมโดย Mouseflow นั้นเป็นไปตามนโยบายความเป็นส่วนตัว: https://mouseflow.com/privacy/ FreshDesk FreshDesk เป็นซอฟต์แวร์สนับสนุนลูกค้า บริการนี้ดำเนินการโดย Freshworks, Inc. บริการ FreshDesk อาจรวบรวมข้อมูลจากอุปกรณ์ของคุณ ข้อมูลที่รวบรวมโดย FreshDesk จัดขึ้นตามนโยบายความเป็นส่วนตัว: https://www.freshworks.com/privacy/ Google สถานที่ Google สถานที่เป็นบริการที่ส่งคืนข้อมูลเกี่ยวกับสถานที่โดยใช้คำขอ HTTP ดำเนินการโดย Google บริการ Google สถานที่อาจรวบรวมข้อมูลจากคุณและจากอุปกรณ์ของคุณเพื่อความปลอดภัย ข้อมูลที่รวบรวมโดย Google สถานที่นั้นเป็นไปตามนโยบายความเป็นส่วนตัวของ Google: https://www.google.com/intl/en/policies/privacy/ ความเป็นส่วนตัวของเด็ก บริการของเราไม่ได้กล่าวถึงใครก็ตามที่อายุต่ำกว่า 13 ปี เราไม่ได้รวบรวมข้อมูลส่วนบุคคลที่สามารถระบุตัวตนได้จากใครก็ตามที่อายุต่ำกว่า 13 ปี หากคุณเป็นพ่อแม่หรือผู้ปกครอง และคุณทราบว่าบุตรหลานของคุณได้ให้ข้อมูลส่วนบุคคลแก่เรา โปรด ติดต่อเรา. หากเราทราบว่าเราได้รวบรวมข้อมูลส่วนบุคคลจากผู้ใดก็ตามที่อายุต่ำกว่า 13 ปีโดยไม่มีการตรวจสอบความยินยอมของผู้ปกครอง เราจะดำเนินการตามขั้นตอนเพื่อลบข้อมูลนั้นออกจากเซิร์ฟเวอร์ของเรา หากเราจำเป็นต้องอาศัยความยินยอมเป็นพื้นฐานทางกฎหมายในการประมวลผลข้อมูลของคุณและประเทศของคุณต้องได้รับความยินยอมจากผู้ปกครอง เราอาจต้องได้รับความยินยอมจากผู้ปกครองของคุณก่อนที่เราจะรวบรวมและใช้ข้อมูลนั้น ลิงค์ไปยังเว็บไซต์อื่น บริการของเราอาจมีลิงค์ไปยังเว็บไซต์อื่นที่ไม่ได้ดำเนินการโดยเรา หากคุณคลิกลิงก์ของบุคคลภายนอก คุณจะถูกนำไปยังเว็บไซต์ของบุคคลภายนอกนั้น เราขอแนะนำให้คุณตรวจสอบนโยบายความเป็นส่วนตัวของทุกไซต์ที่คุณเยี่ยมชม เราไม่สามารถควบคุมและไม่รับผิดชอบต่อเนื้อหา นโยบายความเป็นส่วนตัว หรือแนวปฏิบัติของเว็บไซต์หรือบริการของบุคคลที่สาม การเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้ เราอาจอัปเดตนโยบายความเป็นส่วนตัวของเราเป็นครั้งคราว เราจะแจ้งให้คุณทราบถึงการเปลี่ยนแปลงใด ๆ โดยการโพสต์นโยบายความเป็นส่วนตัวใหม่ในหน้านี้ เราจะแจ้งให้คุณทราบทางอีเมลและ/หรือประกาศที่ชัดเจนเกี่ยวกับบริการของเรา ก่อนที่การเปลี่ยนแปลงจะมีผลและอัปเดตวันที่ \"อัปเดตล่าสุด\" ที่ด้านบนของนโยบายความเป็นส่วนตัวนี้ คุณควรตรวจสอบนโยบายความเป็นส่วนตัวนี้เป็นระยะสำหรับการเปลี่ยนแปลงใดๆ การเปลี่ยนแปลงนโยบายความเป็นส่วนตัวนี้จะมีผลเมื่อมีการโพสต์ในหน้านี้ ติดต่อเรา หากคุณมีคำถามใด ๆ เกี่ยวกับนโยบายความเป็นส่วนตัวนี้ คุณสามารถติดต่อเรา: ทางอีเมล์: info@gmail.com ทางโทรศัพท์: 8974561236</span></div><div style=\"text-align: justify;\"><br></div>'),
(3, 'เกี่ยวกับเรา', 'aboutus', '																				<div><div style=\"\"><div>เรามีรถยนต์หลากหลายประเภท ตั้งแต่รถยนต์ขนาดเล็ก รถทุกคันของเรามีเครื่องปรับอากาศ พวงมาลัยเพาเวอร์ กระจกไฟฟ้า รถทุกคันของเราซื้อและบำรุงรักษาที่ตัวแทนจำหน่ายอย่างเป็นทางการเท่านั้น รถเกียร์อัตโนมัติมีให้บริการในทุกชั้นโดยสาร เนื่องจากเราไม่มีส่วนเกี่ยวข้องกับผู้ผลิตรถยนต์รายใดรายหนึ่ง เราจึงสามารถจัดหารถยนต์ยี่ห้อและรุ่นต่างๆ ให้ลูกค้าเช่าได้</div><div>ภารกิจของคุณคือการได้รับการยอมรับในฐานะผู้นำระดับโลกในการเช่ารถสำหรับบริษัทต่างๆ และภาครัฐและเอกชน โดยการร่วมมือกับลูกค้าของเราในการจัดหารถเช่า ที่ดีที่สุดและมีประสิทธิภาพมากที่สุด และเพื่อบรรลุความเป็นเลิศด้านการบริการ</div></div></div>\r\n										\r\n										\r\n										'),
(11, 'คำถามที่พบบ่อย', 'faqs', '																				<h2 style=\"border: 0px solid; margin-right: 0px; margin-left: 0px; font-size: 28px; font-weight: inherit; color: rgb(0, 0, 0); font-family: Kanit;\">รถเช่าคืออะไร</h2><p style=\"border: 0px solid; margin-bottom: 20px; font-size: 16px; line-height: 1.8; --text-opacity:1; color: rgba(94,94,94,var(--text-opacity)); font-family: Kanit;\">รถเช่า เป็นบริการให้เช่ารถยนต์เพื่อขับใช้ โดยมีการตกลงระยะเวลาในการเช่า และราคาเช่ารถ การมัดจำ การรับ-ส่งคืนรถ พร้อมทั้งมีเอกสารประกอบการเช่ารถ เพื่อให้เกิดความมั่นใจได้ทั้งผู้เช่ารถและผู้ให้เช่ารถ</p><h2 style=\"border: 0px solid; margin-right: 0px; margin-left: 0px; font-size: 28px; font-weight: inherit; color: rgb(0, 0, 0); font-family: Kanit;\">ใครที่จองรถเช่าได้บ้าง</h2><p style=\"border: 0px solid; margin-bottom: 20px; font-size: 16px; line-height: 1.8; --text-opacity:1; color: rgba(94,94,94,var(--text-opacity)); font-family: Kanit;\">ผู้ที่จองรถเช่า ต้องเป็นไปตามข้อตกลงของการเช่ารถ คือมีอายุถึงตามกำหนดที่ทางผู้ให้บริการรถเช่ากำหนดไว้ เช่น บางที่กำหนดไว้ที่อายุ 21 ปี บางที่กำหนดไว้ที่ 23 ปี เป็นต้น</p><h2 style=\"border: 0px solid; margin-right: 0px; margin-left: 0px; font-size: 28px; font-weight: inherit; color: rgb(0, 0, 0); font-family: Kanit;\">การคิดราคารถเช่า</h2><p style=\"border: 0px solid; margin-bottom: 20px; font-size: 16px; line-height: 1.8; --text-opacity:1; color: rgba(94,94,94,var(--text-opacity)); font-family: Kanit;\">การคิดราคารถเช่า โดยส่วนใหญ่จะคิดเป็นวันคือ 24 ชั่วโมง ส่วนราคาเท่าไหร่นั้น จะแล้วแต่รุ่นรถที่ใช้งาน มีตั้งแต่ระดับ เล็กๆ อีโคคาร์ รถเก๋ง รถครอบครัว แล้วแต่ว่าจะเช่าแบบไหน ราคาก็ไล่ระดับขึ้นไป ตั้งแต่หลักร้อยถึงหลักพันนิดๆ ต่อวัน</p>\r\n										\r\n										');

-- --------------------------------------------------------

--
-- Table structure for table `tblsubscribers`
--

CREATE TABLE `tblsubscribers` (
  `id` int(11) NOT NULL,
  `SubscriberEmail` varchar(120) DEFAULT NULL,
  `PostingDate` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `tblsubscribers`
--

INSERT INTO `tblsubscribers` (`id`, `SubscriberEmail`, `PostingDate`) VALUES
(4, 'harish@gmail.com', '2020-07-07 09:26:21'),
(5, 'kunal@gmail.com', '2020-07-07 09:35:07'),
(6, 'veerayuth@gmail.com', '2022-05-09 12:11:55'),
(7, 'rapeepun@gmail.com', '2022-05-09 12:12:01'),
(8, 'aa@gmail.com', '2022-05-18 17:14:41'),
(9, 'mai.candy.2002@gmail.com', '2022-05-18 17:14:47'),
(10, 'nong11@gmail.com', '2022-05-18 17:14:52'),
(11, 'd@gmail.com', '2022-05-18 17:14:57'),
(12, '2010711102011@live4.utcc.ac.th', '2022-05-18 17:15:11'),
(13, 'c@gmail.com', '2022-05-18 17:15:30'),
(14, 'n@gmail.com', '2022-05-18 17:15:36'),
(15, 'nicha@gmail.com', '2022-05-18 17:16:44');

-- --------------------------------------------------------

--
-- Table structure for table `tbltestimonial`
--

CREATE TABLE `tbltestimonial` (
  `id` int(11) NOT NULL,
  `UserEmail` varchar(100) NOT NULL,
  `Testimonial` mediumtext CHARACTER SET utf8 NOT NULL,
  `PostingDate` timestamp NOT NULL DEFAULT current_timestamp(),
  `status` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `tbltestimonial`
--

INSERT INTO `tbltestimonial` (`id`, `UserEmail`, `Testimonial`, `PostingDate`, `status`) VALUES
(1, 'test@gmail.com', 'I am satisfied with their service great job', '2020-07-07 14:30:12', 1),
(3, 'veerayuth@gmail.com', 'ดึมากครับ บริการดีมากๆ รถใหม่ ราคาเช่าถูก', '2022-05-09 11:57:03', 1),
(4, 'rapeepun@gmail.com', 'รถดีมาก สะอาด สภาพดี', '2022-05-09 12:05:37', 1),
(5, 'benben@gmail.com', 'เยี่ยม', '2022-05-18 16:45:43', 1),
(6, 'benben@gmail.com', 'ใช้บริการหลายร้อบมากค่ะ ดีจริงๆ', '2022-05-18 16:46:22', 1),
(7, 'nong11@gmail.com', 'คุ้มค่ามากค่ะ', '2022-05-18 16:52:50', 1),
(8, 'nong11@gmail.com', 'ชอบมากๆใช้บริการรอบสองแล้ว ติดใจ', '2022-05-18 16:53:30', 1),
(9, 'aa@gmail.com', 'พึ่งเริ่มมาใช้ครั้งแรกค่ะ ไว้จะแวะว่ารีวิวให้นะคะแต่บริการดีมาก', '2022-05-18 16:58:25', 1),
(10, 'c@gmail.com', 'บริการดี', '2022-05-18 17:04:31', 1),
(11, 'b@gmail.com', 'สะอาดเยี่ยม', '2022-05-18 17:09:51', 1);

-- --------------------------------------------------------

--
-- Table structure for table `tblusers`
--

CREATE TABLE `tblusers` (
  `id` int(11) NOT NULL,
  `FullName` varchar(120) CHARACTER SET utf8 DEFAULT NULL,
  `EmailId` varchar(100) DEFAULT NULL,
  `Password` varchar(100) DEFAULT NULL,
  `ContactNo` char(11) DEFAULT NULL,
  `dob` varchar(100) CHARACTER SET utf8 DEFAULT NULL,
  `Address` varchar(255) CHARACTER SET utf8 DEFAULT NULL,
  `City` varchar(100) CHARACTER SET utf8 DEFAULT NULL,
  `Country` varchar(100) CHARACTER SET utf8 DEFAULT NULL,
  `RegDate` timestamp NULL DEFAULT current_timestamp(),
  `UpdationDate` timestamp NULL DEFAULT NULL ON UPDATE current_timestamp(),
  `Image` varchar(120) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `tblusers`
--

INSERT INTO `tblusers` (`id`, `FullName`, `EmailId`, `Password`, `ContactNo`, `dob`, `Address`, `City`, `Country`, `RegDate`, `UpdationDate`, `Image`) VALUES
(1, 'Test', 'test@gmail.com', 'f925916e2754e5e03f75dd58a5733251', '6465465465', '', 'L-890, Gaur City Ghaziabad', 'Ghaziabad', 'India', '2020-07-07 14:00:49', '2020-07-12 05:44:29', NULL),
(2, 'ภัทรกร', 'kapked@gmail.com', 'e10adc3949ba59abbe56e057f20f883e', '0664553152', '', '', '', '', '2022-04-11 05:30:59', '2022-04-18 04:57:12', NULL),
(4, 'วีรยุทธ บุษรารังษี', 'veerayuth@gmail.com', '827ccb0eea8a706c4c34a16891f84e7b', '0995433344', '04/09/2001', '10 ซอย สาทร 1 แขวง ทุ่งมหาเมฆ เขต สาทร กรุงเทพมหานคร 10120', 'กรุงเทพมหานคร', 'กรุงเทพมหานคร', '2022-05-09 11:54:40', '2022-05-21 17:09:44', 'hug.png'),
(5, 'รพีพรรณ เล็กสุนทร', 'rapeepun@gmail.com', '827ccb0eea8a706c4c34a16891f84e7b', '0982315533', '', '', '', '', '2022-05-09 12:05:06', '2022-05-18 15:48:04', 'kisspng-scottish-tablet-company-some-useful-local-links-5d16cdccd3b1a1.0837679315617755648671.png'),
(6, 'ben ben', 'benben@gmail.com', '81dc9bdb52d04dc20036dbd8313ed055', '099123456', NULL, NULL, NULL, NULL, '2022-05-18 16:41:45', NULL, NULL),
(7, 'nong', 'nong11@gmail.com', '81dc9bdb52d04dc20036dbd8313ed055', '0998765432', '', '', '', '', '2022-05-18 16:51:13', '2022-05-18 16:52:01', NULL),
(8, 'aa', 'aa@gmail.com', '81dc9bdb52d04dc20036dbd8313ed055', '0888888', NULL, NULL, NULL, NULL, '2022-05-18 16:56:40', NULL, NULL),
(9, 'c', 'c@gmail.com', '81dc9bdb52d04dc20036dbd8313ed055', '12345', NULL, NULL, NULL, NULL, '2022-05-18 17:03:07', NULL, NULL),
(10, 'b', 'b@gmail.com', '81dc9bdb52d04dc20036dbd8313ed055', '666666', NULL, NULL, NULL, NULL, '2022-05-18 17:08:15', NULL, NULL),
(11, 'nicha', 'nicha@gmail.com', '81dc9bdb52d04dc20036dbd8313ed055', '111222333', NULL, NULL, NULL, NULL, '2022-05-18 17:16:19', NULL, NULL);

-- --------------------------------------------------------

--
-- Table structure for table `tblvehicles`
--

CREATE TABLE `tblvehicles` (
  `id` int(11) NOT NULL,
  `VehiclesTitle` varchar(150) DEFAULT NULL,
  `VehiclesBrand` int(11) DEFAULT NULL,
  `VehiclesOverview` longtext CHARACTER SET utf8 DEFAULT NULL,
  `PricePerDay` int(11) DEFAULT NULL,
  `FuelType` varchar(100) CHARACTER SET utf8 DEFAULT NULL,
  `ModelYear` int(6) DEFAULT NULL,
  `SeatingCapacity` int(11) DEFAULT NULL,
  `Vimage1` varchar(120) DEFAULT NULL,
  `Vimage2` varchar(120) DEFAULT NULL,
  `Vimage3` varchar(120) DEFAULT NULL,
  `Vimage4` varchar(120) DEFAULT NULL,
  `Vimage5` varchar(120) DEFAULT NULL,
  `AirConditioner` int(11) DEFAULT NULL,
  `PowerDoorLocks` int(11) DEFAULT NULL,
  `AntiLockBrakingSystem` int(11) DEFAULT NULL,
  `BrakeAssist` int(11) DEFAULT NULL,
  `PowerSteering` int(11) DEFAULT NULL,
  `DriverAirbag` int(11) DEFAULT NULL,
  `PassengerAirbag` int(11) DEFAULT NULL,
  `PowerWindows` int(11) DEFAULT NULL,
  `CDPlayer` int(11) DEFAULT NULL,
  `CentralLocking` int(11) DEFAULT NULL,
  `CrashSensor` int(11) DEFAULT NULL,
  `LeatherSeats` int(11) DEFAULT NULL,
  `RegDate` timestamp NOT NULL DEFAULT current_timestamp(),
  `UpdationDate` timestamp NULL DEFAULT NULL ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=latin1;

--
-- Dumping data for table `tblvehicles`
--

INSERT INTO `tblvehicles` (`id`, `VehiclesTitle`, `VehiclesBrand`, `VehiclesOverview`, `PricePerDay`, `FuelType`, `ModelYear`, `SeatingCapacity`, `Vimage1`, `Vimage2`, `Vimage3`, `Vimage4`, `Vimage5`, `AirConditioner`, `PowerDoorLocks`, `AntiLockBrakingSystem`, `BrakeAssist`, `PowerSteering`, `DriverAirbag`, `PassengerAirbag`, `PowerWindows`, `CDPlayer`, `CentralLocking`, `CrashSensor`, `LeatherSeats`, `RegDate`, `UpdationDate`) VALUES
(1, 'Maruti Suzuki Wagon R', 1, 'Maruti Suzuki Wagon R (หรือWagonR ) เป็นเมืองรถผลิตและทำการตลาดโดยอีกแห่งหนึ่งโดยผ่าน บริษัท ในเครือMaruti Suzukiหลักสำหรับตลาดอินเดียตั้งแต่ปี 1999 Wagon R เปิดตัวในอินเดีย 18 ธันวาคมปี 1999 และมีตั้งแต่การอัพเกรดหลายระดับการ โมเดลและสไตล์ของ Wagon R รุ่นที่สองยังใช้ร่วมกับKarimun Wagon Rสำหรับตลาดอินโดนีเซีย และ Wagon R สำหรับตลาดปากีสถาน แม้ว่าจะมีความแตกต่างหลายประการ', 500, 'Petrol', 2019, 5, 'rear-3-4-left-589823254_930x620.jpg', 'tail-lamp-1666712219_930x620.jpg', 'rear-3-4-right-520328200_930x620.jpg', 'steering-close-up-1288209207_930x620.jpg', 'boot-with-standard-luggage-202327489_930x620.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2020-07-07 07:04:35', '2022-05-09 08:37:24'),
(2, 'BMW 5 Series', 2, 'BMW 530eMSport MY2021 มาพร้อมเครื่องยนต์เบนซิน4สูบ\r\nที่มอบพละกำลัง 184 แรงม้า ที่ 5,000-6,500 รอบต่อนาที และ\r\nแรงบิดสูงสุด 300 นิวตันเมตร ที่ 1,350-4,000 รอบต่อนาที\r\nทำงานร่วมกับมอเตอร์ไฟฟ้าในระบบขับเคลื่อนปลั๊กอินไฮบริด ส่ง\r\nกำลังรวมสูงสุดถึง 292 แรงม้า และแรงบิดรวมสูงสุด 420 นิวตัน\r\nเมตร และสามารถเพิ่มกำลังส่งในการเร่งความเร็วได้มากยิ่งขึ้นด้วย\r\nระบบ XtraBoost ซึ่งปลดปล่อยพละกำลังเสริมมากถึง 40 แรงม้า\r\nภายในเวลาเพียง 10 วินาทีเมื่อขับขี่ในโหมด SPORT จึงสามารถโลด\r\nแล่นจาก0ถึง 100 กิโลเมตรได้ภายใน 5.9 วินาที ทำความเร็ว\r\nสูงสุดที่ 235 กิโลเมตรต่อชั่วโมง โดยสามารถขับขี่แบบไร้มลพิษได้\r\nเป็นระยะทาง 52 กิโลเมตรตามมาตรฐาน NEDC ด้วยพลังงานจาก\r\nแบตเตอรี่แรงดันสูงความอุ 120 กิโลวัตต์ชั่วโมงที่ติดตั้งอยู่ใต้เบาะ\r\nหลัง', 1000, 'Petrol', 2018, 5, 'BMW-5-Series-Exterior-102005.jpg', 'BMW-5-Series-New-Exterior-89729.jpg', 'BMW-5-Series-Exterior-102006.jpg', 'BMW-5-Series-Interior-102021.jpg', 'BMW-5-Series-Interior-102022.jpg', 1, 1, 1, 1, 1, 1, 1, 1, NULL, 1, 1, 1, '2020-07-07 07:12:02', '2022-05-09 08:39:14'),
(3, 'Audi Q8', 3, 'เครื่องยนต์เบนซิน V6 ขนาด 3.0 ลิตร 2,995 ซีซี. พ่วงเทอร์โบ กระบอกสูบ x ระยะช่วงชัก : 84.5 x 89.0 มิลลิเมตร อัตราส่วนกำลังอัด 11.2 : 1 กำลังสูงสุด 340 แรงม้า ที่ 5,000 – 6,400 รอบ/นาที แรงบิดสูงสุด 500 นิวตันเมตร ที่ 1,370 – 4,500 รอบ/นาที จับคู่กับเกียร์อัตโนมัติ 8 จังหวะ TipTronic ขับเคลื่อน 4 ล้อ quattro with ultra technology พร้อมติดตั้งเครื่องกำเนิดไฟฟ้ากระแสสลับ (BAS) 48V (Mild Hybrid : MHEV) และ แบตเตอรี่ Lithium-ion เพื่อช่วยในการออกตัว และ ประหยัดน้ำมันมากขึ้น', 3000, 'Petrol', 2017, 5, 'audi-q8-front-view4.jpg', '1920x1080_MTC_XL_framed_Audi-Odessa-Armaturen_Spiegelung_CC_v05.jpg', 'audi1.jpg', '1audiq8.jpg', 'audi-q8-front-view4.jpeg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2020-07-07 07:19:21', '2022-05-09 08:39:34'),
(4, 'Nissan Kicks', 4, 'Nissan Kicks รถยนต์คอมแพ็คเอสยูวี เทคโนโลยี อี-พาวเวอร์ (e-\r\nPOWER) ที่ให้ความเร้าใจผ่านพละกำลังและอัตราเร่งในทันทีเสมือน\r\nรถยนต์ไฟฟ้า 100% พร้อมค้นเร่งอ้อฉริยะ วัน-เพดัล (One-\r\nPedal) โดดเด่นด้วยกระจังหน้าแบบ V-motion ไฟหน้าและไฟท้าย\r\nแบบ LED ทรงบูมเมอแรง การออกแบบแนวเส้นหลังคาแบบลอยตัว\r\n(floating roof line) และภายในใช้ลายเส้นของปีกเครื่องร่อน\r\n(gliding wing) lla: Nissan Intelligent Mobility', 800, 'Diesel', 2020, 5, 'front-left-side-47.jpg', 'kicksmodelimage.jpg', 'download.jpg', 'kicksmodelimage.jpg', '', NULL, NULL, NULL, 1, NULL, 1, 1, 1, NULL, NULL, NULL, NULL, '2020-07-07 07:25:28', '2022-05-09 09:34:06'),
(5, 'Nissan GT-R', 4, 'Nissan GT-R Premium Luxury คือ ซูเปอร์สปอร์คาร์ตระดับตำนานของนิสสันที่ได้รับการพัฒนา และปรับแต่งระบบ\r\nวิศวกรรมจากประสบการณ์กว่า 35 ปี ของนิสสันในการพัฒนารถแข่งในวงการมอเตอร์สปอร์ตระดับโลก ตัวถังแบบแก\r\nsนด์ทัวริ่ง 2+2 ที่นั่ง ขับเคลื่อนด้วยเครื่องยนต์ วี6 ขนาด 3.8 ลิตร ทวินเทอร์โบ ที่ประกอบด้วยมือ ให้พละกำลังสูงสุด\r\n555 แรงม้า ผ่านระบบเกียร์ซีเควนเชียลดูอัลคลัตช์6สปีดที่ สามารถเปลี่ยนเกียร์ได้ภายในเวลาชั่วพริบตา เพียง 0.15\r\nวินาทีเมื่ออยู่ในโหมด R-Mode ถ่ายกำลังลงพื้นด้วยระบบขับเคลื่อน4ล้อ', 2000, 'Petrol', 2019, 5, 'Nissan-GTR-Right-Front-Three-Quarter-84895.jpg', 'Best-Nissan-Cars-in-India-New-and-Used-1.jpg', '2bb3bc938e734f462e45ed83be05165d.jpg', '2020-nissan-gtr-rakuda-tan-semi-aniline-leather-interior.jpg', 'images.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2020-07-07 07:34:17', '2022-05-09 08:40:09'),
(6, 'Nissan Sunny 2020', 4, 'Nissan Sunny 2020ใหม่ รถยนต์ยอดนิยมที่หลายคนชื่นชอบด้วยรูปทรงที่เรียบหรูสวยงามโดดเด่นไม่เหมือนใคร มาพร้อมการออกแบบที่เร้าใจ มีกระจังหน้าและสปอยเลอร์ที่สะดุดตา แถมยังมีกระจกข้างสีดำเพิ่มความเท่ให้กับตัวรถขึ้นไปอีกด้วย Nissan Sunny 2020 มีให้เลือก 3 รุ่น ได้แก่ รุ่น Nissan Sunny 1.5 5MT (99 HP)และรุ่น Nissan Sunny 1.5 dCI 5MT (86 HP) ทั้งหมดนี้มีความโดดเด่นที่แตกต่างกันและความสนุกในทุกการใช้งาน Nissan Sunny 2020ยังมีอุปกรณ์และระบบความปลอดภัยระดับพรีเมี่ยมอีกด้วย เช่น ไฟหน้า LED และไฟ Daytime Running Lights ที่ส่องสว่างได้อย่างชัดเจนทั้งเวลากลางวันและกลางคืน ระบบเปิดและปิดไฟหน้าอัตโนมัติ LED ไฟตัดหมอกคู่หน้า LEDและไฟท้าย LED และไล่ฝ้ากระจกบังหน้าและหลัง', 400, 'CNG', 2018, 5, 'Nissan-Sunny-Right-Front-Three-Quarter-48975_ol.jpg', 'images (1).jpg', 'Nissan-Sunny-Interior-114977.jpg', 'nissan-sunny-8a29f53-500x375.jpg', 'new-nissan-sunny-photo.jpg', 1, 1, NULL, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2020-07-07 09:12:49', '2022-05-09 08:40:33'),
(7, 'Toyota Fortuner', 5, 'Toyota Fortuner Legender มาพร้อมเครื่องยนต์ใหม่ GD Super POWER ที่สุดแห่งขุมพลังเครื่องยนต์ใหม่ เผาไหม้เชื้อเพลิงได้สมบูรณ์แบบ ให้แรงบิดสูงสุดในรอบกว้าง ตอบรับทุกการขับขี่อย่างเต็มสมรรถนะ ประหยัดน้ำมันยิ่งกว่า ด้วยเครื่องยนต์ดีเซล 2.4ลิตร เกียร์อัตโนมัติ 6 สปีด กำลังสูงสุด 110 กิโลวัตต์(150 แรงม้า) ที่ 3,400 รอบ/นาที แรงบิดสูงสุด 400 นิวตัน-เมตร ที่ 1,600-2,000 รอบ/นาที และเครื่องยนต์ 2.8 ลิตร เกียร์อัตโนมัติ 6 สปีด กำลังสูงสุด 150 กิโลวัตต์ ( 204 แรงม้า ) ที่ 3,400 รอบ/นาที แรงบิดสูงสุด 500 นิวตัน-เมตร ที่ 1,600-2,800 รอบ/นาที รองรับน้ำมัน B20\r\n', 3000, 'Petrol', 2020, 5, '2015_Toyota_Fortuner_(New_Zealand).jpg', 'toyota-fortuner-legender-rear-quarters-6e57.jpg', 'zw-toyota-fortuner-2020-2.jpg', 'download (1).jpg', '', NULL, NULL, NULL, NULL, NULL, 1, 1, 1, NULL, 1, 1, 1, '2020-07-07 09:17:46', '2022-05-09 08:40:41'),
(8, 'Maruti Suzuki Vitara Brezza', 1, 'Maruti (Suzuki) Vitara Brezza AMT ปี 2018 มาพร้อมกับ 4 รุ่นย่อย ดังนี้ VDi, ZDi, ZDi+ และ ZDi+ Dual Tone กับขุมกำลังดีเซล DDiS ขนาด 1.3 ลิตร ระบบเกียร์ Auto Gear Shift โดยภายนอกมาพร้อมสีใหม่สีส้ม Autumn Orange พร้อมออพชั่นสีทูโทนหลังคาสีขาว Pearl Arctic White และในรุ่นท็อปสุดจะมาพร้อมล้ออัลลอยสีดำ กระจังหน้าโครเมียม ด้านระบบความปลอดภัยติดตั้งมาให้ไม่ว่าจะเป็น จุดยึดเบาะที่นั่งเด็ก ISOFIX เตือนความเร็ว ถุงลมนิรภัยคู่ ระบบเบรก ABS พร้อม EBD เซ็นเซอร์ถอยหลัง เป็นต้น', 600, 'Petrol', 2018, 5, 'marutisuzuki-vitara-brezza-right-front-three-quarter3.jpg', 'marutisuzuki-vitara-brezza-rear-view37.jpg', 'marutisuzuki-vitara-brezza-dashboard10.jpg', 'marutisuzuki-vitara-brezza-boot-space59.jpg', 'marutisuzuki-vitara-brezza-boot-space28.jpg', NULL, 1, 1, 1, NULL, NULL, NULL, NULL, NULL, NULL, 1, 1, '2020-07-07 09:23:11', '2022-05-09 08:40:50'),
(9, 'Toyota C-HR', 5, 'Toyota C-HR Hybrid Premium Safety şuušuUŞvlni Tau\r\nการเพิ่มสเปก โดดเด่นด้วยหลังคาสีใหม่ ไม่เหมือนใคร Silver roof\r\nและล้ออัลลอยสีทูโทนขนาด 17 นิ้ว พร้อมเพิ่มมาตรฐานความ\r\nปลอดภัยระดับโลก รองรับเทคโนโลยีสุดลำ Apple Play และ T-\r\nConnect by TOYOTA สำหรับรถทุกคัน ในราคาสุดพิเศษ พร้อม\r\nรับประกันแบตเตอรี่ไฮบริด 10 ปี และรับประกันระบบไอฮบริด5ปี กับ\r\nราคา 1,139,000 บาท (พร้อมข้อเสนอสุดพิเศษ ดอกเบี้ยต่ำ 0.99%\r\nและรับฟรีประกันภัยชั้น1Toyota Careมูลค่า 33,000 บาท)\r\n*สำหรับสีพิเศษ Platinum White Pearl เพิ่ม 7,000 บาท', 500, 'CNG', 2018, 5, '1.1.jpeg', '1.2.jpeg', '1.3.jpeg', '1.4.jpeg', '1.5.jpeg', 1, NULL, NULL, 1, 1, NULL, NULL, 1, 1, NULL, NULL, NULL, '2022-04-04 05:05:16', '2022-05-09 08:40:59'),
(10, 'Nissan Almera', 4, 'All-New NISSAN ALMERA 2020 ออกแบบรูปทรงโดยรวม และไฟท้าย ให้ความปราดเปรียว โดยจุดเด่นของ All-New NISSAN ALMERA 2020 เห็นจะเป็นการเล่นสีดำต่อเนื่องจากขอบกระจกให้มีเส้นสายต่อเนื่องไปถึงกระจกหลัง ทำให้ดูแปลกตา พร้อมลายเส้น All-New NISSAN ALMERA 2020 ที่โดดเด่นส่งให้ไฟท้ายดูเด่นจากการตัดของด้วยสีดำ สำหรับการออกแบบภายนอก All-New NISSAN ALMERA 2020 แล้วมันลงตัว และสวยงาม ขึ้นจากโมเดลเดิมอย่างเห็นได้ชัด', 1000, 'Petrol', 2020, 5, 'nissan_almera_2020_1.png', 'nissan_almera_2020_2.png', 'nissan_almera_2020_3.png', 'nissan_almera_2020_4.png', 'nissan_almera_2020_5.png', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 12:31:38', NULL),
(11, 'Honda Jazz', 8, 'New HONDA JAZZ 2020 ให้อารมสปอร์ตแก่ผู้ขับขี่ด้วยหน้าจอแสดงผลที่โดดเด่นให้อารมสปอร์ตกับดารแบ่งโซลการแสดงผลที่สวยงาม และยังมีระบบหน้าจอแสดงข้อมูล MID ที่ครบถ่วน New HONDA JAZZ 2020 เป็นรถยนต์ที่ให้การขับขี่ที่โดดเด่น และมีสไตล์ที่ลงตัวกับความสปอร์ตอย่างเรียบง่าย รู้หรือไม่ New HONDA JAZZ 2020 นั้นสามรถปรับเปลี่ยนห้องโดยสารให้เป็นโซฟาแสนสบายนั้งเล่นได้อย่างง่ายดาย New HONDA JAZZ 2020 สามารถปรับเบาะหน้าให้ราบเป็นระนาบเดียวกับเบาะหลังได้อย่างพอดีสามารถนั้งเป็นโซฟายืดขาได้อย่าง VIP เลยทีเดียว', 600, 'Petrol', 2020, 4, 'honda_jazz_2022_1.jpg', 'honda_jazz_2022_2.jpg', 'honda_jazz_2022_3.jpg', 'honda_jazz_2022_4.jpg', 'honda_jazz_2022_5.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 12:35:59', NULL),
(12, 'Suzuki Swift', 10, 'Suzuki Swift ในโฉมปี 2021 ทั้ง 2 รุ่นย่อย คือ GL (รุ่นเริ่มต้น) และ GLX (รุ่นท็อปสุด)  ใช้เครื่องยนต์เดียวกัน คือเครื่องยนต์เบนซิน รหัส K12M 4 สูบ ขนาด 1.2 ลิตร กำลังสูงสุด 83 แรงม้า ที่ 6,000 รอบ/นาที แรงบิดสูงสุดที่ 108 นิวตันเมตร ที่ 4,400 รอบ/นาที ใช้เทคโนโลยีหัวฉีดคู่หรือ DUALJET เพิ่มประสิทธิภาพด้วยระบบหัวฉีดคู่ที่จัดวางไว้ใกล้กับห้องเผาไหม้ของเครื่องยนต์ และทำงานโดยฉีดน้ำมันเชื้อเพลิงเข้าไปที่กระบอกสูบพร้อมกันทั้ง 2 หัวฉีด ทำให้น้ำมันมีละอองที่ละเอียดขึ้น อัดฉีดน้ำมันได้แม่นยำ และเป็นการลดอุณหภูมิในกระบอกสูบพร้อมกับเพิ่มประสิทธิภาพในการเผาไหม้ นอกจากนี้เครื่องยนต์ DUALJET ยังมีระบบ EGR ที่ลดอุณหภูมิในห้องเผาไหม้ ระบายความร้อนแก๊สไอเสียด้วยน้ำและหมุนวนเข้าท่อร่วมไอดี เป็นการลดการเผาไหม้ที่ผิดปกติ ทำให้ประสิทธิภาพของเครื่องยนต์สมบูรณ์ยิ่งขึ้น ประหยัดน้ำมันได้มากถึง 23 กม./ลิตร รองรับน้ำมันสูงสุด E20', 600, 'Petrol', 2021, 4, 'suzuki_swift_2021_1.jpg', 'suzuki_swift_2021_2.jpg', 'suzuki_swift_2021_3.jpg', 'suzuki_swift_2021_4.jpg', 'suzuki_swift_2021_5.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 12:39:41', NULL),
(13, 'Mitsubishi Mirage 2020', 9, 'NEW MITSUBISHI MIRAGE 2020 (มิซูบิชิ มิราจ ใหม่) ทำให้ดูสปอร์ตมากขึ้น ด้วยการใส่มิติของลายละเอียกทั้งกระจังหน้า และกันชนท้ายได้อย่างลงตัว NEW MITSUBISHI MIRAGE 2020 (มิซูบิชิ มิราจ ใหม่) ยังมีชุดแต่งเพิ่มรายละเอียดของ NEW MITSUBISHI MIRAGE 2020 (มิซูบิชิ มิราจ ใหม่) รอบคันทำให้ทุกมุมมองของ NEW MITSUBISHI MIRAGE 2020 (มิซูบิชิ มิราจ ใหม่) ดูสปอร์ต และสะท้อนสไตล์ผู้ขับได้ดีเลยทีเดียว', 600, 'Petrol', 2020, 4, 'mitsu_mirage_2021_1.jpg', 'mitsu_mirage_2021_2.jpg', 'mitsu_mirage_2021_3.jpg', 'mitsu_mirage_2021_4.jpg', 'mitsu_mirage_2021_5.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 12:48:25', NULL),
(14, 'Hyundai CRETA', 11, 'Hyundai CRETA เป็นรถในกลุ่ม B-SUV/Crossover คู่แข่ง Honda HR-V, Toyota Corolla Cross, Mazda CX-30, Haval Jolion, Nissan Kicks, MG ZS และ Peugeot 2008 เปิดตัวอย่างเป็นทางการครั้งแรกในโลกเมื่อเดือน เมษายน 2019 และ ทำการปรับโฉม Minorchange ไปล่าสุดที่อินโดนีเซีย เมื่อ 18 พฤศจิกายน 2021 ที่ผ่านมา', 1500, 'Petrol', 2020, 7, 'hyundai_creta_1.jpg', 'hyundai_creta_2.jpg', 'hyundai_creta_3.jpg', 'hyundai_creta_4.jpg', 'hyundai_creta_5.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 12:51:37', NULL),
(15, 'Ford Fiesta', 13, 'Ford Fiesta  2021 - 2022 มาพร้อมกับเครื่องยนต์ 1.6L Ti-VCT I-4 กำลังสูงสุด 120 แรงม้า แรงบิด 112 ปอนด์ต่อฟุต และเครื่องยนต์ 1.6 ลิตร EcoBoost ®  กำลังสูงสุด 197 แรงม้า แรงบิด 202 ปอนด์ต่อฟุต\r\nด้านความปลอดภัยของ Ford Fiesta  2021 - 2022 ก็มาพร้อมกับระบบความปลอดภัยที่เหนือชั้น ทำให้คุณสามารถมั่นใจได้เลยว่าทุกการเดินทางและทุกเส้นทางคุณจะได้รับความปลอดภัยอย่างสูงสุด', 800, 'Petrol', 2021, 5, 'ford_fiesta_1.jpg', 'ford_fiesta_2.jpg', 'ford_fiesta_3.jpg', 'ford_fiesta_4.jpg', 'ford_fiesta_5.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 12:55:01', NULL),
(16, 'Mazda CX-3', 12, 'Mazda CX-3 เปิดตัวเมื่อวันที่ 10 พฤศจิกายน พ.ศ. 2558 มีให้เลือกถึง 5 รุ่นย่อย ทั้งนี้ยังมาพร้อมกับเครื่องยนต์ เบนซิน และ ดีเซล สามารถเลือกชมรายละเอียด ราคา ผ่อน ดาวน์ Mazda CX-3 2022 รุ่นล่าสุดอย่างเป็นทางการ และสามารถหารุ่นอื่น ๆ ที่ท่านต้องการได้ ราคา มาสด้า CX3 รุ่นเริ่มต้นอยู่ที่ 769,000 บาท', 1000, 'Petrol', 2022, 5, 'mazda_cx_3_1.jpg', 'mazda_cx_3_2.jpg', 'mazda_cx_3_3.jpg', 'mazda_cx_3_4.jpg', 'mazda_cx_3_5.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 12:59:03', NULL),
(17, 'Lexus RX', 15, 'กลุ่ม SUV ของ Lexus (เล็กซัส) นั้นจะเริ่มตั้งแต่ UX, NX, และ RX ไปจนถึง GX และ LX จากไลน์อัพเหล่านี้ก็ดูเหมือนว่าจะครอบคลุมทุกความต้องการของตลาดแล้ว แต่ Lexus คิดว่านั่นยังไม่เพียงพอที่จะดึงดูดลูกค้ากลุ่มใหม่ด้วยเหตุนี้ ทางบริษัทจึงต้องการขยายไลน์อัพด้วยการเปิดตัวครอสโอเวอร์เรือธงรุ่นใหม่', 1500, 'Petrol', 2021, 7, 'lexus_rx_1.jpg', 'lexus_rx_2.jpg', 'lexus_rx_3.jpg', 'lexus_rx_4.jpg', 'lexus_rx_5.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 13:03:06', NULL),
(18, 'Toyota Veloz', 5, 'โดย Toyota Veloz นั้น มาพร้อมความยาวที่ 4,475 มม. ความกว้างที่ 1,750 มม. ความสูง 1,700 มม. ระยะฐานล้อ 2,750 มม. และระยะต่ำสุดจากพื้น 205 มม. ซึ่งมีขนาดตัวถังที่ใหญ่กว่าคู่แข่งในคลาสเดียวกัน\r\nเมื่อมิติตัวถังมีขนาดใหญ่กว่า ก็ทำให้ภายในห้องโดยสารของ Toyota Veloz 2022 นั้น มีความกว้างขวาง โดยทาง Toyota ระบุว่า ความกว้างของรถอเนกประสงค์ 7 ที่นั่งคันนี้ เทียบเท่ากับรถระดับ C-Segment เลยทีเดียว', 1500, 'Petrol', 2022, 7, 'toyata_veloz_1.png', 'toyata_veloz_2.png', 'toyata_veloz_3.png', 'toyata_veloz_4.png', 'toyata_veloz_5.png', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 13:08:27', NULL),
(19, 'Honda Civic', 8, 'Honda Civic 1.5 Turbo Hatchback 7KjÛ2019 snuɔcióuun\r\n5ประตู สปอร์ตพรีเมียมขึ้นด้วยชุดแต่งแบบ RS รอบคันและโดด\r\nเด่นด้วยท่อไอเสียแบบคู่ตรงกลางสไตล์สปอร์ต เทคโนโลยีความ\r\nUaaasius:UULUsnüətwWh (Electric Parking Brake) Auto\r\nBrake Hold (Automatic Brake Hold) Honda SENSING la:\r\nHonda CONNECT นวัตกรรมเชื่อมต่อเพื่อการสื่อสารระหว่างผู้\r\nขับขี่และรถยนต์\r\nLAŠDVUuciuuna 15 ācas VTEC Turbo Direct Injection mav\r\nสูงสุด 173 แรงม้า ที่ 5,500 รอบ/นาที แรงบิดสูงสุด 220 นิวตัน-\r\nเมตร ที่ 5,500 รอบ/นาที ระบบการควบคุมการเปิด-ปิดวาล์วแบบคู่\r\n(Dual VTC) เทอร์โบชาร์จเจอร์ ที่มีระบบควบคุมช่องระบายไอเสีย\r\nส่วนเกินด้วยไฟฟ้า ประหยัดน้ำมันเทียบเท่าเครื่องยนต์ขนาด 18\r\nลิตร', 1000, 'Petrol', 2019, 5, 'honda_civic_1.jpg', 'honda_civic_2.jpg', 'honda_civic_3.jpg', 'honda_civic_4.jpg', 'honda_civic_5.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 13:12:44', NULL),
(20, 'Mitsubishi Xpander', 9, 'มิตซูบิชิ เอ็กซ์แพนเดอร์ ครอส ใหม่ มาพร้อมแนวคิด \"อีกขั้นกับ\r\nSUV ที่เป็นคุณ\" โดดเด่นด้วยรูปลักษณ์แข็งแกร่งโฉบเฉียวเหนือ\r\nระดับสไตล์รถเอสยูวีในเมืองใหญ่ครบครันด้วยความอเนกประสงค์\r\nและการขับขี่ที่ยอดเยี่ยมตอบสนอง\r\nการใช้งานได้อย่างหลากหลายภายในห้องโดยสารกว้างขวางเหนือชั้น\r\nมอบความสะดวกสบายระดับพรีเมียมเพื่อผู้โดยสารทุกคน สัมผัสมิต\r\nซูบิชิ เอ็กซ์แพนเดอร์ ครอส ใหม่ได้แล้ววันนี้ที่โชว์รูมมิตซูบิชิทั่ว\r\nประเทศพิเศษสำหรับช่วงแนะนำด้วยราคาจำหน่าย 899,000 บาท', 1500, 'Petrol', 2017, 7, 'mitsu_xpan_1.jpg', 'mitsu_xpan_2.jpg', 'mitsu_xpan_3.jpg', 'mitsu_xpan_4.jpg', 'mitsu_xpan_5.jpg', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, '2022-05-09 13:16:28', NULL);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `admin`
--
ALTER TABLE `admin`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tblbooking`
--
ALTER TABLE `tblbooking`
  ADD PRIMARY KEY (`id`),
  ADD KEY `userEmail` (`userEmail`);

--
-- Indexes for table `tblbrands`
--
ALTER TABLE `tblbrands`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tblcontactusinfo`
--
ALTER TABLE `tblcontactusinfo`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tblcontactusquery`
--
ALTER TABLE `tblcontactusquery`
  ADD PRIMARY KEY (`id`),
  ADD KEY `EmailId` (`EmailId`);

--
-- Indexes for table `tblpages`
--
ALTER TABLE `tblpages`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tblsubscribers`
--
ALTER TABLE `tblsubscribers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `tbltestimonial`
--
ALTER TABLE `tbltestimonial`
  ADD PRIMARY KEY (`id`),
  ADD KEY `UserEmail` (`UserEmail`);

--
-- Indexes for table `tblusers`
--
ALTER TABLE `tblusers`
  ADD PRIMARY KEY (`id`),
  ADD KEY `EmailId` (`EmailId`);

--
-- Indexes for table `tblvehicles`
--
ALTER TABLE `tblvehicles`
  ADD PRIMARY KEY (`id`),
  ADD KEY `VehiclesBrand` (`VehiclesBrand`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `admin`
--
ALTER TABLE `admin`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `tblbooking`
--
ALTER TABLE `tblbooking`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=27;

--
-- AUTO_INCREMENT for table `tblbrands`
--
ALTER TABLE `tblbrands`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `tblcontactusinfo`
--
ALTER TABLE `tblcontactusinfo`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `tblcontactusquery`
--
ALTER TABLE `tblcontactusquery`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=17;

--
-- AUTO_INCREMENT for table `tblpages`
--
ALTER TABLE `tblpages`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `tblsubscribers`
--
ALTER TABLE `tblsubscribers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=16;

--
-- AUTO_INCREMENT for table `tbltestimonial`
--
ALTER TABLE `tbltestimonial`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `tblusers`
--
ALTER TABLE `tblusers`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=12;

--
-- AUTO_INCREMENT for table `tblvehicles`
--
ALTER TABLE `tblvehicles`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=21;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `tblbooking`
--
ALTER TABLE `tblbooking`
  ADD CONSTRAINT `tblbooking_ibfk_1` FOREIGN KEY (`userEmail`) REFERENCES `tblusers` (`EmailId`);

--
-- Constraints for table `tbltestimonial`
--
ALTER TABLE `tbltestimonial`
  ADD CONSTRAINT `tbltestimonial_ibfk_1` FOREIGN KEY (`UserEmail`) REFERENCES `tblusers` (`EmailId`);

--
-- Constraints for table `tblvehicles`
--
ALTER TABLE `tblvehicles`
  ADD CONSTRAINT `tblvehicles_ibfk_1` FOREIGN KEY (`VehiclesBrand`) REFERENCES `tblbrands` (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
